In [1]:
import sqlite3
import pandas as pd

In [2]:
con =sqlite3.connect("mydb.db")

In [5]:
con.execute('''CREATE TABLE person(id INT PRIMARY KEY NOT NULL, first_name VARCHAR(30) NOT NULL, last_name VARCHAR(50) NOT NULL, age INT) ''')

In [6]:
con.execute(''' INSERT INTO person VALUES(1, "Dina", "Perez", 50) ''')
con.execute(''' INSERT INTO person VALUES(2, "Juan", "Sanchez", 40) ''')
con.execute(''' INSERT INTO person VALUES(3, "Ana", "Lopez", 25) ''')

In [7]:
con.commit()

In [8]:
cursor = con.execute(''' SELECT * FROM person''')

for row in cursor:
    print(f'{row[0]} {row[1]} {row[2]} {row[3]}')

1 Dina Perez 50
2 Juan Sanchez 40
3 Ana Lopez 25

In [9]:
con.execute(''' DELETE FROM person WHERE id = 3''')
con.commit()

In [10]:
cursor = con.execute(''' SELECT * FROM person''')

for row in cursor:
    print(f'{row[0]} {row[1]} {row[2]} {row[3]}')

1 Dina Perez 50
2 Juan Sanchez 40

In [13]:
cursor_df = pd.read_sql('SELECT * FROM person', con)
cursor_df

   id first_name last_name  age
0   1       Dina     Perez   50
1   2       Juan   Sanchez   40

In [11]:
import os 
from dotenv import load_dotenv

load_dotenv()

True

In [12]:
print(f'{os.getenv('DB_USER')}')

myuser